In [46]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn
import datetime as dt
%matplotlib inline

In [47]:
df = pd.read_csv('My Uber Drives - 2016.csv')

In [48]:
df.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [49]:
df.size

8092

In [50]:
df.shape

(1156, 7)

In [51]:
df['START*']

0            Fort Pierce
1            Fort Pierce
2            Fort Pierce
3            Fort Pierce
4            Fort Pierce
              ...
1151             Kar?chi
1152    Unknown Location
1153          Katunayake
1154             Gampaha
1155                 NaN
Name: START*, Length: 1156, dtype: object

In [52]:
# List of cities to be removed
cities_to_remove = ['Islamabad', 'Karachi', 'Lahore', 'Nugegoda', 'Capitol One', 'K Street', 'Agnew', 'Parkwood', 'Central', 'Florence', 'The Drag']

# Create a mask to identify rows with the specified cities in "START" or "STOP" columns
mask = df['START*'].isin(cities_to_remove) | df['STOP*'].isin(cities_to_remove)

# Filter the DataFrame by the inverted mask to keep rows not containing the specified cities
df = df[~mask]

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 970 entries, 0 to 1155
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   START_DATE*  970 non-null    object
 1   END_DATE*    969 non-null    object
 2   CATEGORY*    969 non-null    object
 3   START*       969 non-null    object
 4   STOP*        969 non-null    object
 5   MILES*       970 non-null    float64
 6   PURPOSE*     588 non-null    object
dtypes: float64(1), object(6)
memory usage: 60.6+ KB

In [54]:
df.describe()

             MILES*
count    970.000000
mean      23.630722
std      392.149486
min        0.500000
25%        3.000000
50%        6.100000
75%       11.000000
max    12204.700000

In [55]:
df.columns

Index(['START_DATE*', 'END_DATE*', 'CATEGORY*', 'START*', 'STOP*', 'MILES*',
       'PURPOSE*'],
      dtype='object')

In [56]:
# removing underscore from the coulumns 
df.rename(columns = {'START_DATE*' : 'StartDate', 'END_DATE*' : 'EndDate', 'CATEGORY*' : 'Category', 'START*': 'Start', 'STOP*' : 'Stop',
 'MILES*' : 'Miles', 'PURPOSE*' : 'Purpose'}, inplace = True )

In [57]:
df.columns

Index(['StartDate', 'EndDate', 'Category', 'Start', 'Stop', 'Miles',
       'Purpose'],
      dtype='object')

In [58]:
df.drop([1155], axis =0, inplace=True)

In [59]:
# Convert datatype of StartDate into datetime
df.StartDate = pd.to_datetime(df.StartDate)

In [60]:
df.EndDate = pd.to_datetime(df.EndDate)

In [61]:
# chech null
df.isnull().sum()

StartDate      0
EndDate        0
Category       0
Start          0
Stop           0
Miles          0
Purpose      381
dtype: int64

In [62]:
#making the nulled filled with string not applicable
na = 'Not Applicable'
df.Purpose = df.Purpose.fillna('NA')
df.isnull().sum()

StartDate    0
EndDate      0
Category     0
Start        0
Stop         0
Miles        0
Purpose      0
dtype: int64

In [63]:
df.Purpose.head(20)

0      Meal/Entertain
1                  NA
2     Errand/Supplies
3             Meeting
4      Customer Visit
5      Meal/Entertain
6             Meeting
7             Meeting
8             Meeting
9      Customer Visit
10            Meeting
11            Meeting
12            Meeting
13     Temporary Site
14    Errand/Supplies
15     Meal/Entertain
16     Meal/Entertain
17     Meal/Entertain
18     Meal/Entertain
19    Errand/Supplies
Name: Purpose, dtype: object

In [64]:
df.duplicated().sum()
df = df.drop_duplicates()
df.duplicated().sum()

0

In [65]:
df['Year'] = df.StartDate.dt.year
df['Year'].head()

0    2016
1    2016
2    2016
3    2016
4    2016
Name: Year, dtype: int64

In [66]:
df['Month'] = df.StartDate.dt.month
df['Month'].head()

0    1
1    1
2    1
3    1
4    1
Name: Month, dtype: int64

In [67]:
df['Day'] = df.StartDate.dt.day
df['Day'].head()

0    1
1    2
2    2
3    5
4    6
Name: Day, dtype: int64

In [68]:
df['StartHour'] = df.StartDate.dt.hour
df['StartHour'].head()

0    21
1     1
2    20
3    17
4    14
Name: StartHour, dtype: int64

In [69]:
def categorize_hour(hour):
    if hour >= 0 and hour < 6:
        return 'Night'
    elif hour >= 6 and hour < 18:
        return 'Day'
    else:
        return 'Night'

In [70]:
df['Time of Day'] = df['StartHour'].apply(categorize_hour)
df['Time of Day'].head()

0    Night
1    Night
2    Night
3      Day
4      Day
Name: Time of Day, dtype: object

In [71]:
df['Time Difference'] = df['EndDate'] - df['StartDate']
df['Time Difference'].head()

0   0 days 00:06:00
1   0 days 00:12:00
2   0 days 00:13:00
3   0 days 00:14:00
4   0 days 01:07:00
Name: Time Difference, dtype: timedelta64[ns]

In [72]:
df['Total Hours'] = (df['Time Difference'].apply(lambda x: x.total_seconds() / 3600)).round(2)
df['Total Hours'].head()

0    0.10
1    0.20
2    0.22
3    0.23
4    1.12
Name: Total Hours, dtype: float64

In [73]:
df['MoreThan1Hour'] = df['Total Hours'].apply(lambda x : x > 1, True, False)
df['MoreThan1Hour'].head()

0    False
1    False
2    False
3    False
4     True
Name: MoreThan1Hour, dtype: bool

In [74]:
df['Time Difference (Minutes)'] = ((df['EndDate'] - df['StartDate']).dt.total_seconds() / 60).round(2)
df['Time Difference (Minutes)'].head()

0     6.0
1    12.0
2    13.0
3    14.0
4    67.0
Name: Time Difference (Minutes), dtype: float64

In [75]:
df.head()

,StartDate,EndDate,Category,Start,Stop,Miles,Purpose,Year,Month,Day,StartHour,Time of Day,Time Difference,Total Hours,MoreThan1Hour,Time Difference (Minutes)
0,2016-01-01 21:11:00,2016-01-01 21:17:00,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,2016,1,1,21,Night,0 days 00:06:00,0.10,False,6.0
1,2016-01-02 01:25:00,2016-01-02 01:37:00,Business,Fort Pierce,Fort Pierce,5.0,NA,2016,1,2,1,Night,0 days 00:12:00,0.20,False,12.0
2,2016-01-02 20:25:00,2016-01-02 20:38:00,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,2016,1,2,20,Night,0 days 00:13:00,0.22,False,13.0
3,2016-01-05 17:31:00,2016-01-05 17:45:00,Business,Fort Pierce,Fort Pierce,4.7,Meeting,2016,1,5,17,Day,0 days 00:14:00,0.23,False,14.0
4,2016-01-06 14:42:00,2016-01-06 15:49:00,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit,2016,1,6,14,Day,0 days 01:07:00,1.12,True,67.0

In [76]:
df.shape

(968, 16)

In [77]:
df['month_name'] = df['StartDate'].dt.month_name()
df['month_name'].head()

0    January
1    January
2    January
3    January
4    January
Name: month_name, dtype: object

In [78]:
df['DayName'] = df['StartDate'].dt.day_name()
df['DayName'].head()

0       Friday
1     Saturday
2     Saturday
3      Tuesday
4    Wednesday
Name: DayName, dtype: object

In [79]:
df.to_csv('UberCleanDate.csv')